system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2310.5                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// A simple structured mesh for a vertical slice of a blast furnace

scale 1;

vertices
(
    (0 -0.5 0) // 0
    (0 0.5 0) // 1
    (-70 0.5 0) // 2
    (-70 -0.5 0) // 3
    (0 -0.5 50) // 4
    (0 0.5 50) // 5
    (-70 0.5 50) // 6
    (-70 -0.5 50) // 7
    (-75 0.5 50) // 8
    (-75 -0.5 50) // 9
    (0 -0.5 55) // 10
    (0 0.5 55) // 11
    (-75 0.5 55) // 12
    (-75 -0.5 55) // 13
    (-71.2466 0.5 55) // 14
    (-71.2466 -0.5 55) // 15
    (0 -0.5 90) // 16
    (0 0.5 90) // 17
    (-79.9731 0.5 90) // 18
    (-79.9731 -0.5 90) // 19
    (0 -0.5 130) // 20
    (0 0.5 130) // 21
    (-80 0.5 130) // 22 79.9731 -> 80
    (-80 -0.5 130) // 23
    (0 -0.5 300) // 24
    (0 0.5 300) // 25
    (-53 0.5 300) // 26 53.0478 -> 53
    (-53 -0.5 300) // 27
    (0 -0.5 320) // 28
    (0 0.5 320) // 29
    (-53 0.5 320) // 30
    (-53 -0.5 320) // 31
);

edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 40 24) simpleGrading (1 -2 2)
    hex (4 5 6 7 10 11 14 15) (1 40 2) simpleGrading (1 -2 1)
    hex (7 6 8 9 15 14 12 13) (1 6 2) simpleGrading (1 -2 1)
    hex (10 11 14 15 16 17 18 19) (1 40 16) simpleGrading (1 -2 1)
    hex (16 17 18 19 20 21 22 23) (1 40 20) simpleGrading (1 -2 1)
    hex (20 21 22 23 24 25 26 27) (1 40 80) simpleGrading (1 -2 1)
    hex (24 25 26 27 28 29 30 31) (1 40 10) simpleGrading (1 -2 -2)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(9 8 12 13)
		);
	}
	
	outlet
	{
		type patch;
		faces
		(
			(27 26 30 31)
		);
	}
	
	walls
	{
		type wall;
		faces
		(
			(0 1 2 3)
			(3 2 6 7)
			(7 6 8 9)
			(15 13 12 14)
			(15 14 18 19)
			(19 18 22 23)
			(23 22 26 27)
			(28 31 30 29)
		);
	}
	
	symmetry
	{
		type symmetryPlane;
		faces
		(
			(0 4 5 1)
			(4 10 11 5)
			(10 16 17 11)
			(16 20 21 17)
			(20 24 25 21)
			(24 28 29 25)
		);
	}
	
	empty
	{
		type	empty;
		faces
		(
			(1 5 6 2)
			(5 11 14 6)
			(6 14 12 8)
			(11 17 18 14)
			(17 21 22 18)
			(21 25 26 22)
			(25 29 30 26)
			
			(0 3 7 4)
			(4 7 15 10)
			(7 9 13 15)
			(10 15 19 16)
			(16 19 23 20)
			(20 23 27 24)
			(24 27 31 28)
		);
	}
)

mergePatchPairs
(
);


