system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.9;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;

    div(phi,alpha.air)              Gauss vanLeer;
    div(phi,alpha.coal)             Gauss vanLeer;
    div(phi,alpha.iron)             Gauss vanLeer;
    div(phir,alpha.air,alpha.coal)  Gauss vanLeer;
    div(phir,alpha.coal,alpha.air)  Gauss vanLeer;
    div(phir,alpha.air,alpha.iron)  Gauss vanLeer;
    div(phir,alpha.iron,alpha.air)  Gauss vanLeer;
    div(phir,alpha.coal,alpha.iron) Gauss vanLeer;
    div(phir,alpha.iron,alpha.coal) Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss linearUpwind grad(U);
    "div\(phi.*,U.*\)"              Gauss linearUpwind grad(U);
    
    "div\(alphaRhoPhi.*,(h|e).*\)"  Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,K.*\)"      Gauss limitedLinear 1;
    "div\(alphaPhi.*,p\)"           Gauss limitedLinear 1;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
    // Если поставить uncorrected, то будет Negative initial temperature T0: -192.611
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected; // У меня неортогональная сетка, надобно corrected
    // Если поставить uncorrected, то будет Negative initial temperature T0: -192.611
}


// ************************************************************************* //

