system/setFieldsDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
	volScalarFieldValue T.air 300
	volScalarFieldValue T.coal 300
	volScalarFieldValue T.iron 300
    volScalarFieldValue alpha.air  1
    volScalarFieldValue alpha.coal 0
    volScalarFieldValue alpha.iron 0
);

regions
(
    boxToCell
    {
        box (-70 -0.5 30) (0 0.5 40); // минимальные координаты, максимальные координаты
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.iron 0
            volScalarFieldValue alpha.coal 1
        );
    }

    boxToCell
    {
        box (-70 -0.5 0) (0 0.5 30);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.iron 1
            volScalarFieldValue alpha.coal 0
        );
    }
);

// ************************************************************************* //
